package service

const (
	ProxyAddr = "proxyAddr"
)

const (
	EastRegion  = "东区学生宿舍"
	YuanBaoShan = "元宝山学生宿舍"
	SouthEast   = "东南区学生宿舍"

	Dong23 = "东23"
	Dong18 = "东区18栋"
)

// ConstantMap 定义校区的标号真心觉得奇怪
var ConstantMap = map[string]string{
	"东区学生宿舍":  "0002",
	"西区学生宿舍":  "0001",
	"南湖学生宿舍":  "0004",
	"元宝山学生宿舍": "0003",
	"东南区学生宿舍": "0026",
	"国际园区":    "0006",
	"东区教工宿舍":  "0007",
	"西区教工宿舍":  "0008",
	"北区教工宿舍":  "0015",
	"职教区教工宿舍": "0018",
	"合同工学生宿舍": "0010",
	"南湖公租房2期": "0028",
	"院系办公教学楼": "0014",
	"公共教学楼":   "0005",
	"办公楼":     "0013",
	"配电房":     "0011",
	"食堂":      "0016",
	"商业网点":    "0017",
	"菜鸟驿站":    "0025",
	"路灯管理区":   "0023",
	"桂子山北村":   "0019",
	"桂子山东村":   "0020",
	"桂子山西村":   "0021",
	"桂子山南村":   "0022",
	"水泵房":     "0012",
}

var TrimPrefixItems = []string{
	"辅导",
	"新增",
	"新",
}

var TrimSuffixItems = []string{
	"-",
	"活",
}

var RemoveItems = []string{
	"爱心房",
	" ",
}

var ReplaceItems = map[string]string{
	"空调1":  "空调",
	"照明1":  "照明",
	"--":   "-",
	"学生宿舍": "-",
}

var EqualFold = map[string]struct{}{
	"南8-4":   {},
	"南11-空调": {},
	"南12-空调": {},
	"2-1空调":  {},
	"南3-2空调": {},
	"南7-2空调": {},
	"南6-1空调": {},
	"南湖12-7": {},
}

var BlackList = []string{
	"未标", // 新增未标, 未标照明, 6未标6, 未标, 公共未标, 12层公共未标,未标公共1
	"留学", // 国三出国留学办公室, 留学服务中心, 自费留学中心1
	"桂航平价",
	"中百罗森",
	"厨房",  // x层厨房, 国5-0324厨房
	"卫生间", // 卫生间, B卫生间走道, 一楼卫生间, 卫生间照明, 一层公共卫生间
	"停用",  // 东5-3-103(停用), 有家便利店二店(停用, 南12-327空调停用
	"备用",  // 备用2, 备用, 备用-2KAA6, 移动-原备用-2AA10
	"架空层", // 南1-1空调(架空层)
	"公",   // 南9-公共照明, 南10-公共插座, 磷化公办公室电表4, 一层公共卫生间, 国5-公共未标, 东01栋-1-公共
	"副食",  // 十号楼副食, 好运副食2, 南11-副食店,
	"辅导员", // 东1-辅导员照明, 东附1-辅导员, 东4-新401空调辅导员
	"大厅",  // 东5-大厅1楼, 大厅
	"广告牌",
	"消防",
	"电", // 101配电房, 电梯对面-1, 闪开充电桩, 1号楼历史文化学院电表, 1号楼西边配电箱马院系, 三号楼配电房--3AN1, 二楼西配电间2, 照明用电3a主供 2KAA7
	"联通",
	"移动",
	"线", // AA1-1#-2#进线, AA11-1#-进线总表
	"网", // AN07东区网球场, 网关, 东1-配电房照明和网络, 电信网, 网络机柜空调, 东15-网络电信
	"监控",
	"行", // 书刊发行社12号井  DN50, 行政办公室, 中国银行102号井  DN20, 行政楼附楼27号井 DN50, 自行车棚, 琴行3 ,
	"路灯",
	"瑞泰华",
	"室", // 东1-活动室照明, 东1-值班室空调, 东4-室外广告牌, 办公室, 西7-自习室照明1, 南15-107（多功能室）照明
	"应急",
	"未知",
	"机",  // 国6-售货机, 洗衣机。吹风机, 北23-5-牛奶机, B606机房 , 教室风机 , 一楼柜机 ,2126微机室 , 加压风机, 屋顶2号热泵机组
	"器",  // 变压器 , 开水器总表 , 元5-厕所感应器 ,
	"总表", //元5-总表, 南12-总表照明 ,
	"大",  // 华师大驾校 新大正食堂 大厅 大教室  大学生活动中心-1  大会议室  至北大门配
	"旧信息",
	"微",  // 东6-活动室1照明-微波炉一分2  北附20-移动微站  微机教学实训室12空调
	"水",  // -热水表 -开水  2水房
	"菜鸟", // 东区菜鸟驿站
	"功能", // 东4-多功能厅  1楼多功能洗衣机-2
	"？？？",
	"无", // 无标签
	"心触动",
	"洗衣", // 南湖超市打印店和洗衣房 洗衣机
	"培风文化",
	"杏坛和丰",
	"门禁",
	"超市",
	"拾田麦社烘焙坊",
	"中商华师国际园",
	"过道",
	"铁塔",
	"东照明",
	"西照明",
	"星", // 武汉星绁园
	"车", // 南5-电瓶车  南9-车棚  东5-3-102车队 北35-502车库 东区棉花中心-洗车店
	"深邦",
	"厕", // 厕所 东13-东后厕 男/女厕-1
	"仓库",
	"物业",
	"园林",
	"月", // 1月1日空调
	"日", // 正日旭升 1月1日空调
	"插座",
}
